card = '''
    +++++++++++++
    +           +
    +           +
    +           +
    +           +
    +    ♥      +     変態奇術師(★ ・_・▲ )「１だ。」
    +           +
    +           +
    +           +
    +           +
    +++++++++++++
    '''















print('変態奇術師(★ ・_・▲ )「僕の予知能力をお見せしようか。」')
input()
print('変態奇術師(★ ・_・▲ )「…さて、1から13までのカード、まずこの中から好きな数を選んで、頭に思い浮かべて。」')
input()
input()
print('変態奇術師(★ ・_・▲ )「…いいかな？」')
input()
print('変態奇術師(★ ・_・▲ )「思い浮かべたらその数に4を足して、さらに倍にする。」')
input()
print('変態奇術師(★ ・_・▲ )「そこから6を引き、2で割った後、最初に思い浮かべた数を引くといくつになる？」')
input()
input()
print('変態奇術師(★ ・_・▲ )「…僕にはその答えがあらかじめ分かっている。」')
input()
print('変態奇術師(★ ・_・▲ )「その数字は…」')
input()
input()
print(card)
